content/posts/The_Structure_and_Interpretation_of_the_Standard_Model_by_Gordon_McCabe_in_2007.md
+++
title = "The Structure and Interpretation of the Standard Model by Gordon McCabe in 2007"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:09-04:00
slug = "The_Structure_and_Interpretation_of_the_Standard_Model_by_Gordon_McCabe_in_2007"
draft = false
+++

## see also {#see-also}


### [Physics and geometry by Edward Witten in 1986]({{< relref "Physics_and_geometry_by_Edward_Witten_in_1986" >}}) {#physics-and-geometry-by-edward-witten-in-1986--physics-and-geometry-by-edward-witten-in-1986-dot-md}


## 1. Introduction {#1-dot-introduction}


### in relativistic quantum theory the two basic types of thing which are represented to exist are matter fields and gauge force fields {#in-relativistic-quantum-theory-the-two-basic-types-of-thing-which-are-represented-to-exist-are-matter-fields-and-gauge-force-fields}


### a matter field interacts locally with a gauge field, which then interacts locally elsewhere with other matter fields. {#a-matter-field-interacts-locally-with-a-gauge-field-which-then-interacts-locally-elsewhere-with-other-matter-fields-dot}


## 2. Matter fields {#2-dot-matter-fields}


### Free matter fields are those which are idealized to be free from interaction with gauge force fields {#free-matter-fields-are-those-which-are-idealized-to-be-free-from-interaction-with-gauge-force-fields}


### "matter field" and "particle" are often used interchangeably despite the fact they should be distinguished. the matter field is the primary object of consideration, and, if they exist at all, particles are derivative {#matter-field-and-particle-are-often-used-interchangeably-despite-the-fact-they-should-be-distinguished-dot-the-matter-field-is-the-primary-object-of-consideration-and-if-they-exist-at-all-particles-are-derivative}


### 2.1 The local space-time symmetry group {#2-dot-1-the-local-space-time-symmetry-group}

<!--list-separator-->

-  To specify the free elementary particles capable of existing in a universe, i.e., the free elementary ‘particle ontology,’ one specifies the projective, unitary, irreducible representations of a ‘local’ space–time symmetry group. However, because free particles are physical idealisations, one works backwards from the space–time symmetry group of interacting systems, and one bestows this symmetry group on free particles to ensure that when the idealisation is removed, and interactions are included, the space–time symmetry group is correct.

<!--list-separator-->

-  the space–time symmetry group of interacting particles is determined by which gauge fields exist, and the way in which matter fields couple to those gauge fields.

<!--list-separator-->

-  one specifies the free elementary particle ontology of our universe by specifying the ordinary, irreducible, unitary representations of \\[SL(2, \mathbb{C}) \ltimes \mathbb{R}^{3,1}\\].


### 2.2 The configuration space approach {#2-dot-2-the-configuration-space-approach}


### 2.3 Curved space-time {#2-dot-3-curved-space-time}


### 2.4 The Wigner approach {#2-dot-4-the-wigner-approach}


### 2.5 Parity {#2-dot-5-parity}


### 2.6 Free particles in other universes {#2-dot-6-free-particles-in-other-universes}


### 2.7 Natural bundles {#2-dot-7-natural-bundles}


### 2.8 Spinor bundles {#2-dot-8-spinor-bundles}


### 2.9 Electrons and neutrinos {#2-dot-9-electrons-and-neutrinos}


### 2.10 Particles and anti-particles {#2-dot-10-particles-and-anti-particles}


### 2.11 Fock space and second quantization {#2-dot-11-fock-space-and-second-quantization}


## 3. Gauge fields {#3-dot-gauge-fields}


### 3.1 Principal fibre bundles and G-structures {#3-dot-1-principal-fibre-bundles-and-g-structures}


### 3.2 Classification of principal G-bundles {#3-dot-2-classification-of-principal-g-bundles}


### 3.3 Gauge connections {#3-dot-3-gauge-connections}


### 3.4 Choice of gauge and gauge transformations {#3-dot-4-choice-of-gauge-and-gauge-transformations}


### 3.5 Gauge field curvature {#3-dot-5-gauge-field-curvature}


### 3.6 The interaction bundle picture {#3-dot-6-the-interaction-bundle-picture}


## 4. Interactions {#4-dot-interactions}


### 4.1 Interacting fields {#4-dot-1-interacting-fields}

<!--list-separator-->

-  Configuration space approach

    <!--list-separator-->

    -  A free particle of mass \\[m\\] and spin \\[s\\] represented by a cross-section \\[\phi\\] of a spin-\\[s\\] free-particle bundle \\[\eta\\] must satisfy free field equations

        <!--list-separator-->

        -  \\[\mathscr{P}(x, \phi(x), (\nabla^\eta \phi)(x), (\nabla^{\eta^2}\phi)(x), \ldots) = 0\\]

        <!--list-separator-->

        -  where \\[\mathscr{P}\\] is a polynomial expression, the mass \\[m\\] is a coefficient in the polynomial, and \\[\nabla^\eta\\] is the Levi-Civita connection on \\[\eta\\]

    <!--list-separator-->

    -  Free gauge fields represented by \\[G\\]-connections \\[\nabla^\delta\\] on an interaction bundle \\[\delta\\] must satisfy the free-field Yang-Mills equations

        <!--list-separator-->

        -  \\[\nabla \cdot R^{\nabla^\delta} = 0\\]

        <!--list-separator-->

        -  where \\[R^{\nabla^\delta}\\] is the curvature two-form of the connection \\[\nabla^\delta\\]

        <!--list-separator-->

        -  \\[G\\]-connections on the interaction bundle \\[\delta\\] correspond to smooth cross-sections of an affine bundle \\[\mathscr{C}(\delta)\\]

<!--list-separator-->

-  Interactions can be

    <!--list-separator-->

    -  1) self

    <!--list-separator-->

    -  2) boson field \\[\phi\\] and fermion field \\[\psi\\] interact via the Yukawa interaction

    <!--list-separator-->

    -  3) a matter field can interact with a gauge field

        <!--list-separator-->

        -  \\[\psi\\] is a cross-section of an interacting-particle bundle \\[\alpha\\]

        <!--list-separator-->

        -  \\[\nabla^\delta\\] is a connection on the interaction bundle \\[\delta\\]

        <!--list-separator-->

        -  the pair \\[(\psi, \nabla^\delta)\\] is a cross-section of the direct sum \\[\alpha \oplus \mathscr{C}(\delta)\\] and it must satisfy coupled field equations consisting of

            <!--list-separator-->

            -  the interacting field equation upon the cross-sections \\[\psi\\] of \\[\alpha\\]

                <!--list-separator-->

                -  \\[\mathscr{P}(x, \psi(x), ( (\nabla^\eta \otimes \nabla^\delta) \phi)(x), ((\nabla^{\eta} \otimes \nabla^\delta)^2  \psi)(x), \ldots) = 0\\]

            <!--list-separator-->

            -  the coupled Yang-Mills equation upon the curvature \\[R^{\nabla^\delta}\\] of the connection on \\[\delta\\]

                <!--list-separator-->

                -  \\[\nabla \cdot R^{\nabla^\delta} = C\_0 J(\psi)\\]

                <!--list-separator-->

                -  where \\[C\_0\\] is related to the coupling constants of the gauge field specifying the strength of the interaction

                <!--list-separator-->

                -  \\[J(\psi)\\] is a \\[4\\]-current on \\[\mathcal{M}\\], a cross-section of \\[T^\* \mathcal{M} \otimes \mathfrak{g}(\delta)\\]


### 4.2 Interaction symmetries {#4-dot-2-interaction-symmetries}


### 4.3 The electroweak gauge connection bundle {#4-dot-3-the-electroweak-gauge-connection-bundle}


### 4.4 The Higgs field {#4-dot-4-the-higgs-field}


### 4.5 Minimal coupling {#4-dot-5-minimal-coupling}


### 4.6 The Lagrangian approach {#4-dot-6-the-lagrangian-approach}


### 4.7 Quark colors {#4-dot-7-quark-colors}


### 4.8 Quark mixing and the Cabibbo angle {#4-dot-8-quark-mixing-and-the-cabibbo-angle}


### 4.9 The standard model Lagrangian {#4-dot-9-the-standard-model-lagrangian}


### 4.10 Gauge fields in other universes {#4-dot-10-gauge-fields-in-other-universes}


### 4.11 Composite systems {#4-dot-11-composite-systems}


### 4.12 Baryons, mesons, and hadron symmetries {#4-dot-12-baryons-mesons-and-hadron-symmetries}


### 4.13 Elementary particles and intrinsic properties {#4-dot-13-elementary-particles-and-intrinsic-properties}


## 5. Standard model gauge groups and representations {#5-dot-standard-model-gauge-groups-and-representations}


### 5.1 The structure of compact groups {#5-dot-1-the-structure-of-compact-groups}


### 5.2 Standard model irreducible representations {#5-dot-2-standard-model-irreducible-representations}


### 5.3 The standard model gauge group {#5-dot-3-the-standard-model-gauge-group}


### 5.4 Duality and triality {#5-dot-4-duality-and-triality}


### 5.5 The electroweak gauge group {#5-dot-5-the-electroweak-gauge-group}


### 5.6 The electromagnetic subgroup {#5-dot-6-the-electromagnetic-subgroup}


## 6. The standard model interacting-particle bundle {#6-dot-the-standard-model-interacting-particle-bundle}


### 6.1 Standard model electroweak-unified bundle {#6-dot-1-standard-model-electroweak-unified-bundle}


### 6.2 Standard model electroweak-broken bundle {#6-dot-2-standard-model-electroweak-broken-bundle}


## Appendices {#appendices}


### A. Topology {#a-dot-topology}


### B. Lie groups and Lie algebras {#b-dot-lie-groups-and-lie-algebras}


### C. Fibre bundles {#c-dot-fibre-bundles}


### D. Representations of \\[SL(2,\mathbb{C}) \ltimes \mathbb{R}^{3,1}\\] on \\[\mathcal{F}(\mathcal{M},\mathbb{C}^n)\\] {#d-dot-representations-of-sl--2-mathbb-c--ltimes-mathbb-r-3-1-on-mathcal-f--mathcal-m-mathbb-c-n}


### E. The method of induced representation {#e-dot-the-method-of-induced-representation}


### F. Canonical field quantization {#f-dot-canonical-field-quantization}


### G. Photons and the Gupta-Bleuler technique {#g-dot-photons-and-the-gupta-bleuler-technique}


### H. Component expression of the curvature two-form {#h-dot-component-expression-of-the-curvature-two-form}


### I. Elementary particles in string theory {#i-dot-elementary-particles-in-string-theory}


### J. The structure theorem for compact, connected Lie groups {#j-dot-the-structure-theorem-for-compact-connected-lie-groups}


### K. Irreducible representations of \\[U(1)\\] {#k-dot-irreducible-representations-of-u--1}


### L. Non-integral charge and hypercharge {#l-dot-non-integral-charge-and-hypercharge}


### M. Representations onto spaces tensored with \\[\mathbb{C}^1\\] {#m-dot-representations-onto-spaces-tensored-with-mathbb-c-1}


### N. Electroweak interaction bundles {#n-dot-electroweak-interaction-bundles}
